10/data/attachments/a11c8bc3392147f4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_73f871aa-97cf-46d5-b60e-8769caff7014</nif:username>
            <nif:friendToBeAdded>William_from_Actions_45411_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>